# Classification Exercises

### 1. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

- print the first 3 rows
- print the number of rows and columns (shape)
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables. 
    
   Would you recommend rescaling the data based on these statistics?

In [80]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [81]:
df_iris = sns.load_dataset('iris')

In [82]:
type(df_iris)

pandas.core.frame.DataFrame

In [83]:
#print the first 3 rows
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [84]:
#print the number of rows and columns (shape)
df_iris.shape

(150, 5)

In [85]:
#print the column names
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [86]:
#print the data type of each column
df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [87]:
#print the summary statistics for each of the numeric variables.
df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### Would you recommend rescaling the data based on these statistics?

### -Yes

### 2. Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

- assign the first 100 rows to a new dataframe, df_excel_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.

In [9]:
 df_excel = pd.read_excel('Table1_CustDetails.xlsx', sheet_name='Table1_CustDetails')

In [10]:
 df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,has_phone,has_internet,has_phone_and_internet,partner_dependents,start_date,avg_monthly_charge,contract_type.1,phone_type,internet_type,Unnamed: 24
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,...,True,True,True,3,2020-11-09 21:43:43.104,65.6,1 Year,One Line,DSL,NaN
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,...,True,True,True,0,2020-11-09 13:46:58.656,59.9,Month-to-Month,Two or More Lines,DSL,NaN
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,...,True,True,True,0,2021-04-18 09:42:13.248,73.9,Month-to-Month,One Line,Fiber Optic,NaN
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,...,True,True,True,1,2020-07-23 19:16:50.304,98.0,Month-to-Month,One Line,Fiber Optic,NaN
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,...,True,True,True,1,2021-05-07 01:23:48.480,83.9,Month-to-Month,One Line,Fiber Optic,NaN

In [11]:
df_excel.shape

(7049, 25)

In [12]:
df_excel_sample = df_excel.head(100)

In [14]:
df_excel_sample.shape

(100, 25)

In [88]:
df_excel_sample.columns[0:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [36]:
df_excel_sample.dtypes

customer_id                       object
gender                            object
is_senior_citizen                  int64
partner                           object
dependents                        object
phone_service                      int64
internet_service                   int64
contract_type                      int64
payment_type                      object
monthly_charges                  float64
total_charges                    float64
churn                             object
tenure                           float64
is_female                           bool
has_churned\n                       bool
has_phone                           bool
has_internet                        bool
has_phone_and_internet              bool
partner_dependents                 int64
start_date                datetime64[ns]
avg_monthly_charge               float64
contract_type.1                   object
phone_type                        object
internet_type                     object
Unnamed: 24                      float64
dtype: object

In [92]:
numerics = df_excel_sample.select_dtypes(include=['float64', 'int64'])

In [93]:
numerics.max() - numerics.min()

is_senior_citizen        1.000000
phone_service            2.000000
internet_service         2.000000
contract_type            2.000000
monthly_charges         97.400000
total_charges         8476.850000
tenure                  73.177334
partner_dependents       3.000000
avg_monthly_charge      97.400000
Unnamed: 24                   NaN
dtype: float64

In [37]:
df_cols_object_type_bool = df_excel_sample.dtypes == 'object'
df_cols_object_type_bool

customer_id                True
gender                     True
is_senior_citizen         False
partner                    True
dependents                 True
phone_service             False
internet_service          False
contract_type             False
payment_type               True
monthly_charges           False
total_charges             False
churn                      True
tenure                    False
is_female                 False
has_churned\n             False
has_phone                 False
has_internet              False
has_phone_and_internet    False
partner_dependents        False
start_date                False
avg_monthly_charge        False
contract_type.1            True
phone_type                 True
internet_type              True
Unnamed: 24               False
dtype: bool

In [38]:
object_type_cols = df_excel_sample.dtypes[df_cols_object_type_bool]
object_type_cols

customer_id        object
gender             object
partner            object
dependents         object
payment_type       object
churn              object
contract_type.1    object
phone_type         object
internet_type      object
dtype: object

In [39]:
range_monthly_charges = df_excel.monthly_charges.max() - df_excel.monthly_charges.min()
range_monthly_charges

100.5

In [40]:
range_total_charges = df_excel.total_charges.max() - df_excel.total_charges.min()
range_total_charges

8666.0

In [41]:
range_avg_monthly_charges = df_excel.avg_monthly_charge.max() - df_excel.avg_monthly_charge.min()
range_avg_monthly_charges

118.75

In [42]:
range_tenure = df_excel.tenure.max() - df_excel.tenure.min()
range_tenure

79.34177215

In [43]:
url = "https://gist.githubusercontent.com/ryanorsinger/3fce5a65b5fb8ab728af5192c7de857e/raw/a0422b7b73749842611742a1064e99088a47917d/clean_telco.csv"
df_excel = pd.read_csv(url, index_col="id")

# 3. Read the data from this google sheet into a dataframe, df_google

- print the first 3 rows
- print the number of rows and columns
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables
- print the unique values for each of your categorical variables

In [48]:
sheet_url = "https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit?usp=sharing"

csv_export_url = sheet_url.replace('/edit?usp=sharing', '/export?format=csv')

df_google = pd.read_csv(csv_export_url)
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [49]:
df_google.shape

(891, 12)

In [94]:
df_google.columns.tolist()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [95]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [96]:
df_google.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [98]:
#print the unique values for each of your categorical variables

for column in df_google.select_dtypes(include = 'object').columns:
        print(f"Values in the {column} column:")
        print(df_google[column].value_counts())
        print('----')
        print ()

Values in the Name column:
Turja, Miss. Anna Sofia            1
Connolly, Miss. Kate               1
Ekstrom, Mr. Johan                 1
Panula, Master. Juha Niilo         1
White, Mr. Percival Wayland        1
                                  ..
Landergren, Miss. Aurora Adelia    1
Sage, Master. Thomas Henry         1
Arnold-Franchi, Mr. Josef          1
Nankoff, Mr. Minko                 1
Gilinski, Mr. Eliezer              1
Name: Name, Length: 891, dtype: int64
----

Values in the Sex column:
male      577
female    314
Name: Sex, dtype: int64
----

Values in the Ticket column:
CA. 2343    7
347082      7
1601        7
CA 2144     6
347088      6
           ..
347081      1
228414      1
345765      1
C 4001      1
2685        1
Name: Ticket, Length: 681, dtype: int64
----

Values in the Cabin column:
G6             4
C23 C25 C27    4
B96 B98        4
F2             3
D              3
              ..
C46            1
A23            1
B41            1
D48            1
B38            1
Name: Cabin, Length: 147, dtype: int64
----

Values in the Embarked column:
S    644
C    168
Q     77
Name: Embarked, dtype: int64
----

In [55]:
df_google.Survived.unique()

array([0, 1])

In [56]:
df_google.Pclass.unique()

array([3, 1, 2])

In [57]:
df_google.Sex.unique()

array(['male', 'female'], dtype=object)

In [58]:
df_google.SibSp.unique()

array([1, 0, 3, 4, 2, 5, 8])

In [59]:
df_google.Parch.unique()

array([0, 1, 2, 5, 3, 4, 6])

In [60]:
df_google.Cabin.unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [61]:
df_google.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [69]:
def get_db_url(host, user, password, database):
        
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    
    return url

def get_titanic_data():
    from env import host, user, password

    database = 'titanic_db'

    query = "SELECT * FROM passengers;"

    df = pd.read_sql(query, get_db_url(host,user, password, 'titanic_db'))

    return df

In [70]:
df = get_titanic_data()

In [71]:
df

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,None,Southampton,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,None,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,None,Queenstown,1

In [72]:
def get_iris_data():
    from env import host, user, password
       
    database = 'iris_db'

    query = "SELECT * FROM species;"

    df = pd.read_sql(query, get_db_url(host,user, password, 'iris_db'))

    return df

In [73]:
df_iris = get_iris_data()
df_iris

   species_id species_name
0           1       setosa
1           2   versicolor
2           3    virginica